#include<stdio.h>
int main()
{
	int money = 278970;
	int m50000 = money / 50000;
	int m10000 = (money - (50000 * m50000)) / 10000;
	int m5000 = (money - (50000 * m50000) - (10000 * m10000)) / 5000;
	int m1000 = (money - (50000 * m50000) - (10000 * m10000) - (5000 * m5000)) / 1000; 
	int m500 =  (money - (50000 * m50000) - (10000 * m10000) - (5000 * m5000) - (1000 * m1000)) / 500;
	int m100 = (money - (50000 * m50000) - (10000 * m10000) - (5000 * m5000) - (1000 * m1000) - (500 * m500)) / 100;
	int m50 = (money - (50000 * m50000) - (10000 * m10000) - (5000 * m5000) - (1000 * m1000) - (500 * m500) - (100 * m100)) / 50;
	int m10 = (money - (50000 * m50000) - (10000 * m10000) - (5000 * m5000) - (1000 * m1000) - (500 * m500) - (100 * m100) - (50 * m50)) / 10;
	
	printf("50000원권은 %d개 입니다.\n", m50000);
	printf("10000원권은 %d개 입니다.\n", m10000);
	printf("5000원권은 %d개 입니다.\n", m5000);
	printf("1000원권은 %d개 입니다.\n", m1000);
	printf("500원권은 %d개 입니다.\n", m500);
	printf("100원권은 %d개 입니다.\n", m100);
	printf("50원권은 %d개 입니다.\n", m50);
	printf("10원권은 %d개 입니다.\n", m10);
	
	return 0;
}
